{"cord_uid":"iuglkdcp","sha":"5a054a570f409d5c2006369f19addc98d024b6c1","source_x":"PMC","title":"Predicting pseudoknotted structures across two RNA sequences","doi":"10.1093\/bioinformatics\/bts575","pmcid":"PMC3516145","pubmed_id":"23044552","license":"cc-by","abstract":"Motivation: Laboratory RNA structure determination is demanding and costly and thus, computational structure prediction is an important task. Single sequence methods for RNA secondary structure prediction are limited by the accuracy of the underlying folding model, if a structure is supported by a family of evolutionarily related sequences, one can be more confident that the prediction is accurate. RNA pseudoknots are functional elements, which have highly conserved structures. However, few comparative structure prediction methods can handle pseudoknots due to the computational complexity. Results: A comparative pseudoknot prediction method called DotKnot-PW is introduced based on structural comparison of secondary structure elements and H-type pseudoknot candidates. DotKnot-PW outperforms other methods from the literature on a hand-curated test set of RNA structures with experimental support. Availability: DotKnot-PW and the RNA structure test set are available at the web site http:\/\/dotknot.csse.uwa.edu.au\/pw. Contact: janaspe@csse.uwa.edu.au Supplementary information: Supplementary data are available at Bioinformatics online.","publish_time":"2012-12-01","authors":"Sperschneider, Jana; Datta, Amitava; Wise, Michael J.","journal":"Bioinformatics","mag_id":null,"who_covidence_id":null,"arxiv_id":null,"pdf_json_files":"document_parses\/pdf_json\/5a054a570f409d5c2006369f19addc98d024b6c1.json","pmc_json_files":"document_parses\/pmc_json\/PMC3516145.xml.json","url":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3516145\/","s2_id":null,"pr_title":["predicting pseudoknotted structure across two rna sequence"],"pr_abstract":["motivation laboratory rna structure determination structure","sequence method rna secondary structure folding model structure family sequence","rna pseudoknots functional element structure","however comparative structure prediction method pseudoknots complexity","pseudoknot method dotknot secondary structure element type pseudoknot candidate","dotknot outperforms method literature hand test rna structure","dotknot rna structure test available web site http dotknot csse","contact edu supplementary information supplementary data available bioinformatics","sequence method rna secondary structure prediction structure family sequence prediction","rna structure computational structure prediction","contact available","rna structure","pseudoknot prediction method secondary structure pseudoknot","method test set rna structure","structure prediction method computational","rna structure test set available"]}